# FabricParamLocationGeneric Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricParamLocationGeneric Property
ParameterTypeId Class See Also
---
"Location": Fabric location in the host.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricParamLocationGeneric { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricParamLocationGeneric As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricParamLocationGeneric {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace